=== Content from www.openwall.com_3ab08944_20250114_200036.html ===



    "drop_tail" in ethtool -S.

    The issue exists in various forms since the tc-taprio offload was introduced.

    Fixes: de143c0e274b ("net: dsa: felix: Configure Time-Aware Scheduler via taprio offload")
    Reported-by: Richie Pearn <richard.pearn@nxp.com>
    Signed-off-by: Vladimir Oltean <vladimir.oltean@nxp.com>
    Signed-off-by: Jakub Kicinski <kuba@kernel.org>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 6c2cd055561f26b659c6f6bbde05e34d9c94a54c
Author: Vladimir Oltean <vladimir.oltean@nxp.com>
Date:   Tue Jun 28 17:52:35 2022 +0300

    net: dsa: felix: keep reference on entire tc-taprio config

    [ Upstream commit 1c9017e44af2eee94b1001af18c401ae440ad77c ]

    In a future change we will need to remember the entire tc-taprio config
    on all ports rather than just the base time, so use the
    taprio_offload_get() helper function to replace ocelot_port->base_time
    with ocelot_port->taprio.

    Signed-off-by: Vladimir Oltean <vladimir.oltean@nxp.com>
    Signed-off-by: Jakub Kicinski <kuba@kernel.org>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit dd31b754e04d195a2f07b587d724bd34f1c62411
Author: Xiaoliang Yang <xiaoliang.yang_1@nxp.com>
Date:   Fri Jun 17 11:24:23 2022 +0800

    net: dsa: felix: update base time of time-aware shaper when adjusting PTP time

    [ Upstream commit 8670dc33f48bab4d7bb4b8d0232f17f4dae419ec ]

    When adjusting the PTP clock, the base time of the TAS configuration
    will become unreliable. We need reset the TAS configuration by using a
    new base time.

    For example, if the driver gets a base time 0 of Qbv configuration from
    user, and current time is 20000. The driver will set the TAS base time
    to be 20000. After the PTP clock adjustment, the current time becomes
    10000. If the TAS base time is still 20000, it will be a future time,
    and TAS entry list will stop running. Another example, if the current
    time becomes to be 10000000 after PTP clock adjust, a large time offset
    can cause the hardware to hang.

    This patch introduces a tas_clock_adjust() function to reset the TAS
    module by using a new base time after the PTP clock adjustment. This can
    avoid issues above.

    Due to PTP clock adjustment can occur at any time, it may conflict with
    the TAS configuration. We introduce a new TAS lock to serialize the
    access to the TAS registers.

    Signed-off-by: Xiaoliang Yang <xiaoliang.yang_1@nxp.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 9ecc19e28a11768188cd5a9d571b2f1c09eededb
Author: Vladimir Oltean <vladimir.oltean@nxp.com>
Date:   Wed May 11 13:06:36 2022 +0300

    net: mscc: ocelot: minimize holes in struct ocelot_port

    [ Upstream commit 6d0be600477089026c76fe529bd96fad4cf69c3b ]

    Reorder members of struct ocelot_port to eliminate holes and reduce
    structure size. Pahole says:

    Before:

    struct ocelot_port {
            struct ocelot *            ocelot;               /*     0     8 */
            struct regmap *            target;               /*     8     8 */
            bool                       vlan_aware;           /*    16     1 */

            /* XXX 7 bytes hole, try to pack */

            const struct ocelot_bridge_vlan  * pvid_vlan;    /*    24     8 */
            unsigned int               ptp_skbs_in_flight;   /*    32     4 */
            u8                         ptp_cmd;              /*    36     1 */

            /* XXX 3 bytes hole, try to pack */

            struct sk_buff_head        tx_skbs;              /*    40    96 */
            /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
            u8                         ts_id;                /*   136     1 */

            /* XXX 3 bytes hole, try to pack */

            phy_interface_t            phy_mode;             /*   140     4 */
            bool                       is_dsa_8021q_cpu;     /*   144     1 */
            bool                       learn_ena;            /*   145     1 */

            /* XXX 6 bytes hole, try to pack */

            struct net_device *        bond;                 /*   152     8 */
            bool                       lag_tx_active;        /*   160     1 */

            /* XXX 1 byte hole, try to pack */

            u16                        mrp_ring_id;          /*   162     2 */

            /* XXX 4 bytes hole, try to pack */

            struct net_device *        bridge;               /*   168     8 */
            int                        bridge_num;           /*   176     4 */
            u8                         stp_state;            /*   180     1 */

            /* XXX 3 bytes hole, try to pack */

            int                        speed;                /*   184     4 */

            /* size: 192, cachelines: 3, members: 18 */
            /* sum members: 161, holes: 7, sum holes: 27 */
            /* padding: 4 */
    };

    After:

    struct ocelot_port {
            struct ocelot *            ocelot;               /*     0     8 */
            struct regmap *            target;               /*     8     8 */
            struct net_device *        bond;                 /*    16     8 */
            struct net_device *        bridge;               /*    24     8 */
            const struct ocelot_bridge_vlan  * pvid_vlan;    /*    32     8 */
            phy_interface_t            phy_mode;             /*    40     4 */
            unsigned int               ptp_skbs_in_flight;   /*    44     4 */
            struct sk_buff_head        tx_skbs;              /*    48    96 */
            /* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
            u16                        mrp_ring_id;          /*   144     2 */
            u8                         ptp_cmd;              /*   146     1 */
            u8                         ts_id;                /*   147     1 */
            u8                         stp_state;            /*   148     1 */
            bool                       vlan_aware;           /*   149     1 */
            bool                       is_dsa_8021q_cpu;     /*   150     1 */
            bool                       learn_ena;            /*   151     1 */
            bool                       lag_tx_active;        /*   152     1 */

            /* XXX 3 bytes hole, try to pack */

            int                        bridge_num;           /*   156     4 */
            int                        speed;                /*   160     4 */

            /* size: 168, cachelines: 3, members: 18 */
            /* sum members: 161, holes: 1, sum holes: 3 */
            /* padding: 4 */
            /* last cacheline: 40 bytes */
    };

    Signed-off-by: Vladimir Oltean <vladimir.oltean@nxp.com>
    Signed-off-by: Jakub Kicinski <kuba@kernel.org>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit fdc2b73b48ac98e691bf9c6817e1bfbc9d203990
Author: Vladimir Oltean <vladimir.oltean@nxp.com>
Date:   Wed May 11 13:06:35 2022 +0300

    net: mscc: ocelot: delete ocelot_port :: xmit_template

    [ Upstream commit 15f6d01e4829cd2a2dc4f02a00c51d7cec1c736d ]

    This is no longer used since commit 7c4bb540e917 ("net: dsa: tag_ocelot:
    create separate tagger for Seville").

    Signed-off-by: Vladimir Oltean <vladimir.oltean@nxp.com>
    Signed-off-by: Jakub Kicinski <kuba@kernel.org>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 864362e9cacd935579cf2af761e20a9a182e847f
